In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90,100])

In [3]:
print(ser)

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [4]:
ser1 = pd.Series([0,10,20,30,40,50,60,70,80,90,100,'data'])

In [5]:
print(ser1)

0        0
1       10
2       20
3       30
4       40
5       50
6       60
7       70
8       80
9       90
10     100
11    data
dtype: object

In [6]:
print(ser1[11])

data

In [7]:
ser1[11] = 101

In [9]:
print(ser1)

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
11    101
dtype: object

In [10]:
# create dictionary

dict1 = {'A':[1,2,3],'B':[2,3,4],'C':[22,33,44],'D':[33,99,56]}

In [13]:
df = pd.DataFrame(dict1)

In [14]:
print(df)

   A  B   C   D
0  1  2  22  33
1  2  3  33  99
2  3  4  44  56

### Adding new column

In [15]:
df['States'] = "CA NV AZ".split()

In [16]:
df

   A  B   C   D States
0  1  2  22  33     CA
1  2  3  33  99     NV
2  3  4  44  56     AZ

In [17]:
## understanding split() method while Adding

var = "CA NV AZ".split()

In [18]:
var

['CA', 'NV', 'AZ']

## Create NAN and manipulation

In [21]:
dict2 = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[22,33,44]}

In [22]:
df1 = pd.DataFrame(dict2)

In [23]:
df1

     A    B   C
0  1.0  5.0  22
1  2.0  NaN  33
2  NaN  NaN  44

In [24]:
df1['states'] = 'CA NV AZ'.split()

In [25]:
df1

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

In [28]:
print('\n Dropping any column with a NaN values\n','-'*30,sep ='')
print(df1.dropna(axis =1))

## axis = colunms wise
## axis = 0 rows wise

 Dropping any column with a NaN values
------------------------------
    C states
0  22     CA
1  33     NV
2  44     AZ

In [30]:
df1
## my dataFrame till have the same original dataset

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

## The method __fillna()__

In [34]:
print('\n Dropping any column with a NaN values\n','-'*38)
print(df1.fillna(value = 20))

 Dropping any column with a NaN values
 --------------------------------------
      A     B   C states
0   1.0   5.0  22     CA
1   2.0  20.0  33     NV
2  20.0  20.0  44     AZ

In [84]:
print('\n Dropping any row with a NaN values\n','-'*38,sep ='')
print(df1.dropna(axis =1))
## axis = 1  colunms wise
## axis = 0 rows wise

 Dropping any row with a NaN values
--------------------------------------
    C states
0  22     CA
1  33     NV
2  44     AZ

In [39]:
## fill with specifique column mean

print('\n Dropping any column with a NaN values\n','-'*38)
print(df1.fillna(value = df1['A'].mean()))

 Dropping any column with a NaN values
 --------------------------------------
     A    B   C states
0  1.0  5.0  22     CA
1  2.0  1.5  33     NV
2  1.5  1.5  44     AZ

In [41]:
my_dict = {
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Any','Vanessa','Carl','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
}

In [42]:
df3 = pd.DataFrame(my_dict)

In [43]:
df3

  Company   Person  Sale
0    Good      Sam   200
1    Good  Charlie   120
2    MSFT      Any   340
3    MSFT  Vanessa   124
4      FB     Carl   243
5      FB    Sarah   350

In [54]:
by_comp = df3.groupby("Company")

In [46]:
by_comp.mean()

          Sale
Company
FB       296.5
Good     160.0
MSFT     232.0

In [55]:
print('\nGrouping by colum "Company" and listing of sale\n','-'*55,sep='')
by_comp.sum()

### it will calculate only where the column values's is number

Grouping by colum "Company" and listing of sale
-------------------------------------------------------

         Sale
Company
FB        593
Good      320
MSFT      464

## to save everithing permently use __inplace__ = true

In [56]:
df

   A  B   C   D States
0  1  2  22  33     CA
1  2  3  33  99     NV
2  3  4  44  56     AZ

In [57]:
df1

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

In [23]:
my_data = pd.DataFrame(
{
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Any','Vanessa','Carl','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
},index =['A1','A2','A3','A4','A5','A6'])

In [24]:
my_data

   Company   Person  Sale
A1    Good      Sam   200
A2    Good  Charlie   120
A3    MSFT      Any   340
A4    MSFT  Vanessa   124
A5      FB     Carl   243
A6      FB    Sarah   350

In [25]:
my_data1 = pd.DataFrame(
{
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Assie','Yao','Brou','Kouadio','Patrick','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
},index =['A7','A8','A9','A10','A11','A12'])

In [26]:
my_data1

    Company   Person  Sale
A7     Good    Assie   200
A8     Good      Yao   120
A9     MSFT     Brou   340
A10    MSFT  Kouadio   124
A11      FB  Patrick   243
A12      FB    Sarah   350

In [27]:
result_data = pd.concat([my_data,my_data1], axis = 0)

In [28]:
result_data

    Company   Person  Sale
A1     Good      Sam   200
A2     Good  Charlie   120
A3     MSFT      Any   340
A4     MSFT  Vanessa   124
A5       FB     Carl   243
A6       FB    Sarah   350
A7     Good    Assie   200
A8     Good      Yao   120
A9     MSFT     Brou   340
A10    MSFT  Kouadio   124
A11      FB  Patrick   243
A12      FB    Sarah   350

In [35]:
result_data11 = pd.concat([my_data,my_data1], axis = 1)

In [36]:
result_data11

    Company   Person   Sale Company   Person   Sale
A1     Good      Sam  200.0     NaN      NaN    NaN
A2     Good  Charlie  120.0     NaN      NaN    NaN
A3     MSFT      Any  340.0     NaN      NaN    NaN
A4     MSFT  Vanessa  124.0     NaN      NaN    NaN
A5       FB     Carl  243.0     NaN      NaN    NaN
A6       FB    Sarah  350.0     NaN      NaN    NaN
A7      NaN      NaN    NaN    Good    Assie  200.0
A8      NaN      NaN    NaN    Good      Yao  120.0
A9      NaN      NaN    NaN    MSFT     Brou  340.0
A10     NaN      NaN    NaN    MSFT  Kouadio  124.0
A11     NaN      NaN    NaN      FB  Patrick  243.0
A12     NaN      NaN    NaN      FB    Sarah  350.0

In [32]:
result_data1.fillna(value = 100, inplace = True)

In [33]:
result_data1

    Company   Person   Sale Company   Person   Sale
A1     Good      Sam  200.0     100      100  100.0
A2     Good  Charlie  120.0     100      100  100.0
A3     MSFT      Any  340.0     100      100  100.0
A4     MSFT  Vanessa  124.0     100      100  100.0
A5       FB     Carl  243.0     100      100  100.0
A6       FB    Sarah  350.0     100      100  100.0
A7      100      100  100.0    Good    Assie  200.0
A8      100      100  100.0    Good      Yao  120.0
A9      100      100  100.0    MSFT     Brou  340.0
A10     100      100  100.0    MSFT  Kouadio  124.0
A11     100      100  100.0      FB  Patrick  243.0
A12     100      100  100.0      FB    Sarah  350.0

# End of __Saturday__ live class

In [52]:
left1 = pd.DataFrame({'Key':['K0','K1','K2','K3'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})

In [53]:
righ1 = pd.DataFrame({'Key':['K0','K1','K2','K3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
})

In [54]:
print('\n The left1 DataFrame is :\n','-'*26,sep=' ')
print(left1)

 The left1 DataFrame is :
 --------------------------
  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [55]:
print('\n The right1 DataFrame is :\n','-'*26,sep=' ')
print(righ1)

 The right1 DataFrame is :
 --------------------------
  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## __merge()__ method, it works like concat() method

In [59]:
merge_data = pd.merge(left1,righ1, how ='inner', on = 'Key')
merge_data

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [10]:
left = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
},index = ['k0','k1','k2','k3'])

In [13]:
right = pd.DataFrame({
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
},index = ['k0','k2','k3'])

In [11]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2
k3  A3  B3

In [14]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

# How to use __join()__ method

In [68]:
left.join(right)

## keep the left data as it is , and join it with right data
## if data in the left is not present at the right then replace it by NaN

     B   A    C    D
k0  B0  A0   C0   D0
k1  B1  A1  NaN  NaN
k2  B2  A2   C2   D2
k3  B3  A3   C3   D3

In [67]:
left, right

(     B   A
 k0  B0  A0
 k1  B1  A1
 k2  B2  A2
 k3  B3  A3,
      C   D
 k0  C0  D0
 k2  C2  D2
 k3  C3  D3)

### using __outer__ means join and display all match and not matching data

In [69]:
## using outer, it means display everything matching or not.

letf.join(right,how='outer')

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2
k3  A3  B3   C3   D3

# Using a __function__ to manipulate the DateFrame

In [70]:
# Define a function
def testfunct(x):
    if (x > 500):
        return(10 * np.log10(x))
    else:
        return (x/10)

In [71]:
df = pd.DataFrame({
    'col1':[1,2,3,4,5,6,7,8,9,10],
    'col2':[444,555,666,444,333,222,666,777,666,5555],
    'col3':['aaa','bb','c','dd','eeee','fff','gg','h','iii','j']
})

In [72]:
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10  5555     j

In [73]:
df['funcApplied'] = df['col1'].apply(testfunct)
df

   col1  col2  col3  funcApplied
0     1   444   aaa          0.1
1     2   555    bb          0.2
2     3   666     c          0.3
3     4   444    dd          0.4
4     5   333  eeee          0.5
5     6   222   fff          0.6
6     7   666    gg          0.7
7     8   777     h          0.8
8     9   666   iii          0.9
9    10  5555     j          1.0

In [75]:
df['col3_length'] = df['col3'].apply(len)
df

   col1  col2  col3  funcApplied  col3_length
0     1   444   aaa          0.1            3
1     2   555    bb          0.2            2
2     3   666     c          0.3            1
3     4   444    dd          0.4            2
4     5   333  eeee          0.5            4
5     6   222   fff          0.6            3
6     7   666    gg          0.7            2
7     8   777     h          0.8            1
8     9   666   iii          0.9            3
9    10  5555     j          1.0            1

In [79]:
df['sqr_of_f_Aplied_col'] =  df['funcApplied'].apply(lambda x: np.sqrt(x))

In [80]:
df

   col1  col2  col3  funcApplied  col3_length  sqr_of_f_Aplied_col
0     1   444   aaa          0.1            3             0.316228
1     2   555    bb          0.2            2             0.447214
2     3   666     c          0.3            1             0.547723
3     4   444    dd          0.4            2             0.632456
4     5   333  eeee          0.5            4             0.707107
5     6   222   fff          0.6            3             0.774597
6     7   666    gg          0.7            2             0.836660
7     8   777     h          0.8            1             0.894427
8     9   666   iii          0.9            3             0.948683
9    10  5555     j          1.0            1             1.000000

In [60]:
## check the number of columns  in my data frame

letf.columns

Index(['A', 'B'], dtype='object')

In [61]:
l = list(left.columns)

In [62]:
l

['B', 'A']

## to delete DataFrame column use __del__

In [20]:
del left['A']

In [21]:
left

     B
k0  B0
k1  B1
k2  B2
k3  B3

In [41]:
left['A'] ='A0 A1 A2 A3'.split()
left

     B   A
k0  B0  A0
k1  B1  A1
k2  B2  A2
k3  B3  A3

In [ ]:
## sort by using the column values __sort_values( by ='columnName')__

In [37]:
result_data11

    Company   Person   Sale Company   Person   Sale
A1     Good      Sam  200.0     NaN      NaN    NaN
A2     Good  Charlie  120.0     NaN      NaN    NaN
A3     MSFT      Any  340.0     NaN      NaN    NaN
A4     MSFT  Vanessa  124.0     NaN      NaN    NaN
A5       FB     Carl  243.0     NaN      NaN    NaN
A6       FB    Sarah  350.0     NaN      NaN    NaN
A7      NaN      NaN    NaN    Good    Assie  200.0
A8      NaN      NaN    NaN    Good      Yao  120.0
A9      NaN      NaN    NaN    MSFT     Brou  340.0
A10     NaN      NaN    NaN    MSFT  Kouadio  124.0
A11     NaN      NaN    NaN      FB  Patrick  243.0
A12     NaN      NaN    NaN      FB    Sarah  350.0

In [38]:
result_data11.isnull()

     Company  Person   Sale  Company  Person   Sale
A1     False   False  False     True    True   True
A2     False   False  False     True    True   True
A3     False   False  False     True    True   True
A4     False   False  False     True    True   True
A5     False   False  False     True    True   True
A6     False   False  False     True    True   True
A7      True    True   True    False   False  False
A8      True    True   True    False   False  False
A9      True    True   True    False   False  False
A10     True    True   True    False   False  False
A11     True    True   True    False   False  False
A12     True    True   True    False   False  False

In [39]:
result_data11.isnull().sum()

Company    6
Person     6
Sale       6
Company    6
Person     6
Sale       6
dtype: int64